In [1]:
#LO PRIMERO QUE HACEMOS ES IMPORTAR LA LIBRERIA PANDAS PARA HACER USO DE SUS FUNCIONES 
import pandas as pd
#CREAMOS NUESTRO DICCIONARIO LLAMADO "DIC1" QUE ALAMCENARA LOS MESES,VENTAS Y GASTOS CON SUS RESPECTIVOS VALORES
DIC1={
"MESES":["ENERO","FEBRERO","MARZO","ABRIL","MAYO"],
"VENTAS":[30500,35600,28300,33900,42500],
"GASTOS":[22000,23450,18100,35700,32450]
}
#AQUI ESTAMOS CREANDO NUESTRO DATAFRAME QUE SERA ALMACENADO EN LA VARIABLE"df1" Y TENDR√Å COMO INPUT "DIC1"
df1=pd.DataFrame(DIC1) 
df1

     MESES  VENTAS  GASTOS
0    ENERO   30500   22000
1  FEBRERO   35600   23450
2    MARZO   28300   18100
3    ABRIL   33900   35700
4     MAYO   42500   32450

In [2]:
#AQUI ESTAMOS AGREGANDO LA COLUMNA GASTOS / VENTAS *100 
df1["G/V*100"]=df1["GASTOS"] / df1["VENTAS"] * 100
df1

     MESES  VENTAS  GASTOS     G/V*100
0    ENERO   30500   22000   72.131148
1  FEBRERO   35600   23450   65.870787
2    MARZO   28300   18100   63.957597
3    ABRIL   33900   35700  105.309735
4     MAYO   42500   32450   76.352941

In [3]:
#AGREGANDO LA NUEVA COLUMNA V>=3000 
#AQUI LE ESTAMOS DICIENDO QUE SI LA VENTA ES MAYOR O IGUAL A 30000 ESCRIBA "META SUPERADA" SINO ES ASI ENTONCES QUE ESCRIBA
#"META NO SUPERADA"

df1["V >=3000"]=df1["VENTAS"].apply(lambda x:"META SUPERADA" if x >=30000 else "META NO SUPERADA")
df1

     MESES  VENTAS  GASTOS     G/V*100          V >=3000
0    ENERO   30500   22000   72.131148     META SUPERADA
1  FEBRERO   35600   23450   65.870787     META SUPERADA
2    MARZO   28300   18100   63.957597  META NO SUPERADA
3    ABRIL   33900   35700  105.309735     META SUPERADA
4     MAYO   42500   32450   76.352941     META SUPERADA

In [4]:
#MOSTRANDO LOS VALORES DE LOS ULTIMOS TRES ULTIMOS REGISTROS
df1.tail(3)

   MESES  VENTAS  GASTOS     G/V*100          V >=3000
2  MARZO   28300   18100   63.957597  META NO SUPERADA
3  ABRIL   33900   35700  105.309735     META SUPERADA
4   MAYO   42500   32450   76.352941     META SUPERADA

In [5]:
#AQUI ESTAMOS INDICANDO LA SUMA DE LOS 3 ULTIMOS MESES
df1.iloc[2:5,0:2].sum()

MESES     MARZOABRILMAYO
VENTAS            104700
dtype: object

In [6]:
#AQUI ESTAMOS MOSTRANDO LOS CUATRO PRIMEROS REGISTROS
df1.head(4)

     MESES  VENTAS  GASTOS     G/V*100          V >=3000
0    ENERO   30500   22000   72.131148     META SUPERADA
1  FEBRERO   35600   23450   65.870787     META SUPERADA
2    MARZO   28300   18100   63.957597  META NO SUPERADA
3    ABRIL   33900   35700  105.309735     META SUPERADA

In [7]:
#AQUI ESTAMOS MOSTRANDO EL TOTAL DE GASTOS DE FEBRERO A ABRIL Y ADICIONAL EL TOTAL DE VENTAS DE FEBRERO A ABRIL TAMBIEN
df1.iloc[1:4,0:3].sum()

MESES     FEBREROMARZOABRIL
VENTAS                97800
GASTOS                77250
dtype: object